var middle = [
    {
        "school": "初中",
        "name": "天津耀华中学",
        "coor": {
            "lng": 117.20723199663703,
            "lat": 39.12484859478814
        }
    },
    {
        "school": "初中",
        "name": "天津南开中学",
        "coor": {
            "lng": 117.17770747927115,
            "lat": 39.13527022160672
        }
    },
    {
        "school": "初中",
        "name": "天津第一中学",
        "coor": {
            "lng": 117.20126940398401,
            "lat": 39.11941413952035
        }
    },
    {
        "school": "初中",
        "name": "天津实验中学",
        "coor": {
            "lng": 117.19815228386439,
            "lat": 39.10352737077645
        }
    },
    {
        "school": "初中",
        "name": "天津市第二十中学",
        "coor": {
            "lng": 117.2194671871746,
            "lat": 39.12047424870967
        }
    },
    {
        "school": "初中",
        "name": "天津市第一百中学",
        "coor": {
            "lng": 117.34287424220214,
            "lat": 39.08056970779125
        }
    },
    {
        "school": "初中",
        "name": "天津新华中学",
        "coor": {
            "lng": 117.2185943935411,
            "lat": 39.116881330871934
        }
    },
    {
        "school": "初中",
        "name": "天津七中",
        "coor": {
            "lng": 117.24494932974558,
            "lat": 39.13499449501505
        }
    },
    {
        "school": "初中",
        "name": "天津市第42中学",
        "coor": {
            "lng": 117.23230064918178,
            "lat": 39.10171614997446
        }
    },
    {
        "school": "初中",
        "name": "天津市第五十五中学",
        "coor": {
            "lng": 117.18862234037015,
            "lat": 39.1199479399922
        }
    },
    {
        "school": "初中",
        "name": "天津外国语学院附属中学",
        "coor": {
            "lng": 116.3485546054179,
            "lat": 39.75600729747027
        }
    },
    {
        "school": "初中",
        "name": "天津一中",
        "coor": {
            "lng": 117.20126940398401,
            "lat": 39.11941413952035
        }
    }
]